# Pandas 학습

1. 데이터 분석을 위한 모듈
2. excel과 가장 큰 차이점 : Pands 는 대용량 데이터 처리가 가능
3. 데이터 분석 및 데이터 가공에 절대적으로 사용되는 라이브러리
4. 주요 학습 내용
> 1. DataFrame - Excel의 다수의 컬럼들을 보유한 테이블과 동일하다 간주
> 2. Series - DataFrame을 구성하는

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [14]:
pd
s = pd.Series([1,2,3])
print(s)
print(type(s))

0    1
1    2
2    3
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
print(s.values)
print(s.index)
print(s.value_counts)

[1 2 3]
RangeIndex(start=0, stop=3, step=1)
<bound method IndexOpsMixin.value_counts of 0    1
1    2
2    3
dtype: int64>

In [16]:
# python 에서 nn/nan 등은 결측치 의미
s = pd.Series([3,1,2,4,5,np.nan])
print(s)
print("-"*10)
s.value_counts(normalize=True)

0    3.0
1    1.0
2    2.0
3    4.0
4    5.0
5    NaN
dtype: float64
----------

5.0    0.2
4.0    0.2
2.0    0.2
1.0    0.2
3.0    0.2
dtype: float64

In [23]:
# python 에서 nn/nan 등은 결측치 의미
s = pd.Series([3,1,4,5,np.nan])
print(s)
print("-"*10)
s.value_counts(normalize=True)
s.value_counts(dropna=False, normalize=True)

0    3.0
1    1.0
2    4.0
3    5.0
4    NaN
dtype: float64
----------

NaN    0.2
5.0    0.2
4.0    0.2
1.0    0.2
3.0    0.2
dtype: float64

In [29]:
s = pd.Series([3,1,'a','b',np.nan])
print(s)
print(s.count()) # 결측치 무시하고 유효 데이터 수만 count

0      3
1      1
2      a
3      b
4    NaN
dtype: object
4

In [26]:
s = pd.Series([1,2])
print(s)

0    1
1    2
dtype: int64

In [33]:
s = pd.Series(['a','b',np.nan])
print(s)
print('-'*10)
print(s.dropna()) #원본 유지
print('-'*10)
print(s)

0      a
1      b
2    NaN
dtype: object
----------
0    a
1    b
dtype: object
----------
0      a
1      b
2    NaN
dtype: object

특정 날짜를 기준으로 DataFrame 생성해보기

In [37]:
datas = pd.date_range('20210310', periods=5)
datas

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14'],
              dtype='datetime64[ns]', freq='D')

In [91]:
np.random.randint(10)

2

In [92]:
np.random.rand()

0.07596584247392901

In [97]:
df = pd.DataFrame(np.random.rand(6,4))
df

          0         1         2         3
0  0.828563  0.961466  0.897707  0.190109
1  0.227062  0.161031  0.158053  0.464858
2  0.748381  0.991849  0.241493  0.240354
3  0.533443  0.372072  0.381381  0.749462
4  0.149637  0.187775  0.366752  0.888187
5  0.131691  0.911660  0.648463  0.608872

In [98]:
datas = pd.date_range('20210310', periods=12)
datas

DatetimeIndex(['2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21'],
              dtype='datetime64[ns]', freq='D')

In [99]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [100]:
df = pd.DataFrame(pd.date_range('20210310', periods=12))
df

            0
0  2021-03-10
1  2021-03-11
2  2021-03-12
3  2021-03-13
4  2021-03-14
5  2021-03-15
6  2021-03-16
7  2021-03-17
8  2021-03-18
9  2021-03-19
10 2021-03-20
11 2021-03-21

In [217]:
df = pd.DataFrame(np.random.randint(0,12, size=(12, 4)), index = datas, columns = ['a','b','c','d'])
# df = pd.DataFrame(np.random.randint(12, size=(12, 4,3)))

# df = pd.DataFrame([np.random.randint(12),np.random.randint(12),np.random.randint(12)], index = datas, columns = ['a','b','c','d'])
# np.random.randint(12, size=(12, 4))
print(df['a'][2])
df

1

            a   b   c   d
2021-03-10  7   8   8   6
2021-03-11  1   7   8   9
2021-03-12  1   0   3   7
2021-03-13  6   4  11   4
2021-03-14  6   8   7   2
2021-03-15  3   3   1   8
2021-03-16  7   7   9  11
2021-03-17  6  10   6   3
2021-03-18  1   9  11   7
2021-03-19  2   5   9  10
2021-03-20  7   2   6   5
2021-03-21  2   0   6   3

In [110]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2021-03-10 to 2021-03-21
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       12 non-null     float64
 1   1       12 non-null     float64
 2   2       12 non-null     float64
 3   3       12 non-null     float64
dtypes: float64(4)
memory usage: 480.0 bytes

In [162]:
np.random.randint(12, size=(12, 4, 3))
1

1

In [158]:
np.random.randint(12, size=(12, 4))
1

1

In [159]:
np.random.randint(12, size=(12, 4,3))
1

1

In [178]:
s1 = pd.Series([np.random.randint(1, 49) for i in range(48)])
df = pd.concat([s1], axis=1)
1

1

In [157]:
v = np.random.randint(0,48,(12,4))
print(type(v))
print(v.ndim)
print(v.shape)

<class 'numpy.ndarray'>
2
(12, 4)

In [172]:
s1 = pd

In [181]:
df.describe()

               0
count  48.000000
mean   25.208333
std    13.847126
min     2.000000
25%    15.000000
50%    26.500000
75%    37.250000
max    48.000000

In [180]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48 entries, 0 to 47
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       48 non-null     int64
dtypes: int64(1)
memory usage: 512.0 bytes

# 내공 쌓기 : 타입 확인을 위한 코드들

In [212]:
s1 = pd.Series([np.random.randint(1, 49) for i in range(48)]) # pandas.core.series.Series
s2 = pd.Series([np.random.randint(1, 49) for i in range(48)]) # pandas.core.series.Series
df = pd.concat([s1], axis=1)
# df2 = pd.concat([s1,s2], axis=2)

In [207]:
type(s1)

pandas.core.series.Series

In [208]:
type(df)
# print(df)

pandas.core.frame.DataFrame

In [199]:
print('재웅')

재웅

# 가즈아

In [235]:
df = pd.DataFrame(np.random.randint(0,12, size=(12,4)), index = datas, columns = ['A','B','C','D'])
df.sort_values(by='B', ascending=True)

             A   B   C   D
2021-03-21   1   0  10   3
2021-03-19   3   1   0  10
2021-03-12   5   2   8   6
2021-03-18   1   5   7   1
2021-03-16   7   6  10   6
2021-03-20  10   6   7   2
2021-03-10   8   7  11   4
2021-03-15   8   7   1   5
2021-03-17   7   7  11   9
2021-03-14   7   9   2  11
2021-03-11   3  11   9   4
2021-03-13  11  11  11   0

In [236]:
df.A

2021-03-10     8
2021-03-11     3
2021-03-12     5
2021-03-13    11
2021-03-14     7
2021-03-15     8
2021-03-16     7
2021-03-17     7
2021-03-18     1
2021-03-19     3
2021-03-20    10
2021-03-21     1
Freq: D, Name: A, dtype: int32

In [237]:
df

             A   B   C   D
2021-03-10   8   7  11   4
2021-03-11   3  11   9   4
2021-03-12   5   2   8   6
2021-03-13  11  11  11   0
2021-03-14   7   9   2  11
2021-03-15   8   7   1   5
2021-03-16   7   6  10   6
2021-03-17   7   7  11   9
2021-03-18   1   5   7   1
2021-03-19   3   1   0  10
2021-03-20  10   6   7   2
2021-03-21   1   0  10   3

In [238]:
df['2021-03-10' : '2021-03-14'] # index명과 : 표기로 범위 선정해서 검색

             A   B   C   D
2021-03-10   8   7  11   4
2021-03-11   3  11   9   4
2021-03-12   5   2   8   6
2021-03-13  11  11  11   0
2021-03-14   7   9   2  11

In [239]:
df[0:4] # 이건 말그대로 인덱스로 지정

             A   B   C  D
2021-03-10   8   7  11  4
2021-03-11   3  11   9  4
2021-03-12   5   2   8  6
2021-03-13  11  11  11  0

loc 속성
1. 데이터를 slicing 하는 기술
2. loc[index,columns]

In [240]:
df.loc

In [241]:
# 모든 row의 A와 B Series만 slicing
df.loc[:, ['A','B']]

             A   B
2021-03-10   8   7
2021-03-11   3  11
2021-03-12   5   2
2021-03-13  11  11
2021-03-14   7   9
2021-03-15   8   7
2021-03-16   7   6
2021-03-17   7   7
2021-03-18   1   5
2021-03-19   3   1
2021-03-20  10   6
2021-03-21   1   0

In [244]:
df.loc[['2021-03-10','2021-03-14'],:]

            A  B   C   D
2021-03-10  8  7  11   4
2021-03-14  7  9   2  11

In [249]:
df.iloc[[0,2],[0,2]] # 0번째 2번째의 row, 마찬가지로 column을 고르는 것 고르는 것

            A   C
2021-03-10  8  11
2021-03-12  5   8

나라마다 통용되는 화폐의 단위와 갯수는 다르다.

화폐 단위의 예)

대한민국: 10원, 50원, 100원, 500원, 1000원, 5000원, 10000원, 50000원

영국: 1페니, 2펜스, 5펜스, 10펜스, 20펜스, 50펜스, 1파운드(100펜스), 2파운트(200펜스)

**int[] currencies**

의 각 요소는 이 나라에서 사용되는 화폐의 단위를 나타낸다.

이 나라의 화폐를 이용하여,

**int wantMoney**

만큼의 돈을 거슬러주는 모든 방법의 수를 리턴하시오.

In [271]:
class Solution:
    def solution(self, currencies, wantMoney):
        answer = 0
        dp = [0 for i in range(wantMoney+1)]
        dp[0] = 1
        for i in currencies:
            for j in range(i, wantMoney + 1):
                if j - i >= 0:
                    dp[j] += dp[j-i]
        print(dp)
        return dp[wantMoney]

In [272]:
Solution.solution(1,[1,2,5],100)

[1, 1, 2, 2, 3, 4, 5, 6, 7, 8, 10, 11, 13, 14, 16, 18, 20, 22, 24, 26, 29, 31, 34, 36, 39, 42, 45, 48, 51, 54, 58, 61, 65, 68, 72, 76, 80, 84, 88, 92, 97, 101, 106, 110, 115, 120, 125, 130, 135, 140, 146, 151, 157, 162, 168, 174, 180, 186, 192, 198, 205, 211, 218, 224, 231, 238, 245, 252, 259, 266, 274, 281, 289, 296, 304, 312, 320, 328, 336, 344, 353, 361, 370, 378, 387, 396, 405, 414, 423, 432, 442, 451, 461, 470, 480, 490, 500, 510, 520, 530, 541]

541

In [276]:
df['E'] = [1,2,3,4,5,6,1,2,3,4,np.nan,6]

In [277]:
df

             A   B   C   D    E
2021-03-10   8   7  11   4  1.0
2021-03-11   3  11   9   4  2.0
2021-03-12   5   2   8   6  3.0
2021-03-13  11  11  11   0  4.0
2021-03-14   7   9   2  11  5.0
2021-03-15   8   7   1   5  6.0
2021-03-16   7   6  10   6  1.0
2021-03-17   7   7  11   9  2.0
2021-03-18   1   5   7   1  3.0
2021-03-19   3   1   0  10  4.0
2021-03-20  10   6   7   2  NaN
2021-03-21   1   0  10   3  6.0

In [278]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2021-03-10 to 2021-03-21
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     int32
 1   B       12 non-null     int32
 2   C       12 non-null     int32
 3   D       12 non-null     int32
 4   E       11 non-null     float64
dtypes: float64(1), int32(4)
memory usage: 704.0 bytes

In [279]:
df = pd.DataFrame({'float': [1.0],
                   'int': [1],
                   'datetime': [pd.Timestamp('20180310')],
                   'string': ['foo']})
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
dtype: object

항상 고민해야 하는 것 = 결측치가 포함된 데이터 시리즈 타입은 숫자가 아닌 타입으로 적용했는지?
1. 해결책 1 - 결측치 값 대체
            : 0으로? 평균? 중앙값? 빈도수가 높은 데이터(최빈값)?
2. 해결책 2 - 타입 변경
            : 변경가능한 타입으로 변경

In [281]:
df['E'].min()

KeyError: 'E'

In [297]:
df = pd.DataFrame({'float': [1.0],
                   'int': [1],
                   'datetime': [pd.Timestamp('20180310')],
                   'string': ['foo']})
df.dtypes
d = {'col1':[1.0,2.0],'col2':[2,3]}
df = pd.DataFrame(data = d)
df

   col1  col2
0   1.0     2
1   2.0     3

In [295]:
df = df.astype('float64').dtypes
df.dtypes

dtype('O')

In [298]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    2 non-null      float64
 1   col2    2 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [299]:
df = pd.read_csv("0.dataSet/friends.csv")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [308]:
df['이름']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: 이름, dtype: object

In [311]:
df.loc[3, '이름']

'이영자'

In [312]:
df.loc[3, '이름'] = '정찬우'
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  정찬우  45  상담사   talk
4  강호동  38  연예인   talk

In [332]:
df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t")
df

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [333]:
df.columns = ["이름","나이","직업","취미"]
df

    이름  나이   직업     취미
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [335]:
df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t", header=None)
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [337]:
df.columns = ["이름","나이","직업","취미"]
df

    이름  나이   직업     취미
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [340]:
df = pd.read_csv("0.dataSet/friendsTabNoHead.txt", delimiter="\t", names=["이름","나이","직업","취미"])
df

    이름  나이   직업     취미
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [348]:
# series 추가하면서 모든 row에 동일한 데이터 저장
df['연봉'] = 10
df

In [362]:
df['재웅'] = '사랑'
df

    이름  나이   직업     취미  연봉  재웅
0  신동엽  20  연예인  music  10  사랑
1  유재석  41   교수    art  10  사랑
2  김새롬  18   학생  study  10  사랑
3  이영자  45  상담사   talk  10  사랑
4  강호동  38  연예인   talk  10  사랑

In [353]:
a = np.arange(10)
np.where(a < 5, a, 10*a) # a가 5보다 작으면 a, 아니면 10 * a

array([ 0,  1,  2,  3,  4, 50, 60, 70, 80, 90])

In [371]:
df['이름'] != '김새롬'

0     True
1     True
2    False
3     True
4     True
Name: 이름, dtype: bool

In [372]:
df['이름']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: 이름, dtype: object

In [374]:
df['연봉'] = np.where(df['직업'] != '학생', 'yes' , 'no')
print(df)

    이름  나이   직업     취미   연봉  재웅
0  신동엽  20  연예인  music  yes  사랑
1  유재석  41   교수    art  yes  사랑
2  김새롬  18   학생  study   no  사랑
3  이영자  45  상담사   talk  yes  사랑
4  강호동  38  연예인   talk  yes  사랑

In [49]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'}]
type(friend_dict_list)

list

In [50]:
print(type(friend_dict_list[0]))

<class 'dict'>

In [51]:
friend_dict_list[0]['name']

'신동엽'

In [52]:
df = pd.DataFrame(friend_dict_list)

In [53]:
df = df.drop_duplicates(keep='last')
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
4  강호동   38  연예인   talk
5  이영자   45  상담사   talk

In [54]:
df.loc[2, 'name'] = '신동엽'

In [55]:
df.iloc[2,0]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  신동엽   18   학생  study
4  강호동   38  연예인   talk
5  이영자   45  상담사   talk

In [56]:
df.drop_duplicates('name', keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  신동엽   18   학생  study
4  강호동   38  연예인   talk
5  이영자   45  상담사   talk

# 결측치 제거

In [94]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '이영자', 'age' : None, 'job': '상담사', 'hobby' : 'talk'}]
df = pd.DataFrame(friend_dict_list)
df.drop_duplicates('name', keep='last', inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
4  강호동  38.0  연예인   talk
5  이영자   NaN  상담사   talk

In [66]:
print(df['age'].sum())
df['age'].mean()

117.0

29.25

In [96]:
df['age'].fillna(0,inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
4  강호동  38.0  연예인   talk
5  이영자   0.0  상담사   talk

In [68]:
print(df['age'].sum())
df['age'].mean()

117.0

23.4

In [69]:
df['job']

0    연예인
1     교수
2     학생
4    연예인
5    상담사
Name: job, dtype: object

In [76]:
v = df.groupby('job')
print(len(v))
print(v.groups)
v

4
{'교수': [1], '상담사': [5], '연예인': [0, 4], '학생': [2]}

In [97]:
# job별로 age값의 중앙값 연산 후에 DataFrame의 age 값 변환
df.groupby('job')['age'].transform('median')
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
4  강호동  38.0  연예인   talk
5  이영자   0.0  상담사   talk

In [98]:
df.groupby('job')['age'].transform('sum')
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
4  강호동  38.0  연예인   talk
5  이영자   0.0  상담사   talk

In [99]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'},
                     {'name': '고현정', 'age': 44, 'job': '가수', 'hobby':'music'},
                     {'name': '박민영', 'age': 22, 'job': '학생', 'hobby':'art'},
                     {'name': '박서준', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '박보검', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '이효리', 'age' : 28, 'job' : '교수', 'hobby' : 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby':'music'}]
df = pd.DataFrame(friend_dict_list)
df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6   고현정  44.0   가수  music
7   박민영  22.0   학생    art
8   박서준  18.0   학생  study
9   박보검  45.0  상담사   talk
10  이효리  28.0   교수   talk
11  이상순  29.0   주부  music

In [107]:
print(df.job)
print('=='*10)
print(df.job.unique())

0     연예인
1      교수
2      학생
3     상담사
4     연예인
5     연예인
6      가수
7      학생
8      학생
9     상담사
10     교수
11     주부
Name: job, dtype: object
====================
['연예인' '교수' '학생' '상담사' '가수' '주부']

In [110]:
df.job.value_counts()

학생     3
연예인    3
교수     2
상담사    2
가수     1
주부     1
Name: job, dtype: int64

# 데이터 병합

In [109]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]
l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
print(df1)
print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [118]:
df4 = pd.concat([df1,df2], ignore_index=True)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인